Diagram enhancement
